Phase3_Project.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Phase3_Project" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="jp@gc - Ultimate Thread Group-Load Testing_Phase3 Project" enabled="true">
        <collectionProp name="ultimatethreadgroupdata">
          <collectionProp name="1413379525">
            <stringProp name="1603">25</stringProp>
            <stringProp name="0">0</stringProp>
            <stringProp name="1603">25</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="1603">25</stringProp>
          </collectionProp>
          <collectionProp name="1437196891">
            <stringProp name="1691">50</stringProp>
            <stringProp name="50614">325</stringProp>
            <stringProp name="1603">25</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="1691">50</stringProp>
          </collectionProp>
          <collectionProp name="-717833871">
            <stringProp name="1758">75</stringProp>
            <stringProp name="53585">650</stringProp>
            <stringProp name="1691">50</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="1758">75</stringProp>
          </collectionProp>
          <collectionProp name="1922361557">
            <stringProp name="48625">100</stringProp>
            <stringProp name="1507423">1000</stringProp>
            <stringProp name="1758">75</stringProp>
            <stringProp name="46730161">10000</stringProp>
            <stringProp name="1691">50</stringProp>
          </collectionProp>
          <collectionProp name="441546045">
            <stringProp name="1758">75</stringProp>
            <stringProp name="46760174">11075</stringProp>
            <stringProp name="1691">50</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="1603">25</stringProp>
          </collectionProp>
          <collectionProp name="167168377">
            <stringProp name="1691">50</stringProp>
            <stringProp name="46763863">11425</stringProp>
            <stringProp name="1603">25</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
        </collectionProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">reqres.in</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/api/users?page=2</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="jp@gc - Ultimate Thread Group-STRESS Testing-Phase3Project" enabled="true">
        <collectionProp name="ultimatethreadgroupdata">
          <collectionProp name="1413379525">
            <stringProp name="1603">25</stringProp>
            <stringProp name="0">0</stringProp>
            <stringProp name="1603">25</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="1603">25</stringProp>
          </collectionProp>
          <collectionProp name="1437196891">
            <stringProp name="1691">50</stringProp>
            <stringProp name="50614">325</stringProp>
            <stringProp name="1603">25</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="1691">50</stringProp>
          </collectionProp>
          <collectionProp name="-717833871">
            <stringProp name="1758">75</stringProp>
            <stringProp name="53585">650</stringProp>
            <stringProp name="1691">50</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="1758">75</stringProp>
          </collectionProp>
          <collectionProp name="-1861709314">
            <stringProp name="48780">150</stringProp>
            <stringProp name="1507423">1000</stringProp>
            <stringProp name="1758">75</stringProp>
            <stringProp name="46730161">10000</stringProp>
            <stringProp name="1691">50</stringProp>
          </collectionProp>
          <collectionProp name="441546045">
            <stringProp name="1758">75</stringProp>
            <stringProp name="46760174">11075</stringProp>
            <stringProp name="1691">50</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="1603">25</stringProp>
          </collectionProp>
          <collectionProp name="167168377">
            <stringProp name="1691">50</stringProp>
            <stringProp name="46763863">11425</stringProp>
            <stringProp name="1603">25</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
          <collectionProp name="1014249297">
            <stringProp name="1603">25</stringProp>
            <stringProp name="46766834">11750</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="48">0</stringProp>
          </collectionProp>
        </collectionProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">reqres.in</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/api/users?page=2</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="jp@gc - Ultimate Thread Group-Spike Testing-Phase3Project" enabled="true">
        <collectionProp name="ultimatethreadgroupdata">
          <collectionProp name="-1095915231">
            <stringProp name="1603">25</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="1603">25</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="1603">25</stringProp>
          </collectionProp>
          <collectionProp name="1437196891">
            <stringProp name="1691">50</stringProp>
            <stringProp name="50614">325</stringProp>
            <stringProp name="1603">25</stringProp>
            <stringProp name="50547">300</stringProp>
            <stringProp name="1691">50</stringProp>
          </collectionProp>
          <collectionProp name="199538145">
            <stringProp name="48780">150</stringProp>
            <stringProp name="53585">650</stringProp>
            <stringProp name="1691">50</stringProp>
            <stringProp name="51570">420</stringProp>
            <stringProp name="1758">75</stringProp>
          </collectionProp>
          <collectionProp name="-377431768">
            <stringProp name="1691">50</stringProp>
            <stringProp name="1508446">1120</stringProp>
            <stringProp name="1758">75</stringProp>
            <stringProp name="54391">700</stringProp>
            <stringProp name="1691">50</stringProp>
          </collectionProp>
          <collectionProp name="-1139750608">
            <stringProp name="48780">150</stringProp>
            <stringProp name="1515395">1895</stringProp>
            <stringProp name="1691">50</stringProp>
            <stringProp name="51570">420</stringProp>
            <stringProp name="1758">75</stringProp>
          </collectionProp>
          <collectionProp name="1115393324">
            <stringProp name="1691">50</stringProp>
            <stringProp name="1540288">2365</stringProp>
            <stringProp name="1758">75</stringProp>
            <stringProp name="1507423">1000</stringProp>
            <stringProp name="1567">10</stringProp>
          </collectionProp>
          <collectionProp name="294552310">
            <stringProp name="1603">25</stringProp>
            <stringProp name="1570973">3440</stringProp>
            <stringProp name="1567">10</stringProp>
            <stringProp name="48625">100</stringProp>
            <stringProp name="10">10</stringProp>
          </collectionProp>
        </collectionProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">reqres.in</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/api/users?page=2</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>